In [0]:
import pandas as pd

In [0]:
arquivo = '../content/drive/My Drive/Temp/salarios.csv'
df = pd.read_csv(arquivo)

### **Tamanho do DataFrame**

In [30]:
print(df.shape)
print('Linhas:', df.shape[0])
print('Colunas:', df.shape[1])

(32182, 4)
Linhas: 32182
Colunas: 4

### **Resumo do DataFrame**

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32182 entries, 0 to 32181
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32181 non-null  object
 1   Position Title          32181 non-null  object
 2   Department              32181 non-null  object
 3   Employee Annual Salary  32181 non-null  object
dtypes: object(4)
memory usage: 1005.8+ KB

### **Resumo do conteúdo**

In [32]:
df.head()

                  Name  ... Employee Annual Salary
0      AARON,  ELVIA J  ...              $88967.00
1    AARON,  JEFFERY M  ...              $80778.00
2       AARON,  KARINA  ...              $80778.00
3  AARON,  KIMBERLEI R  ...              $84780.00
4  ABAD JR,  VICENTE M  ...             $104736.00

[5 rows x 4 columns]

### **Selecionando colunas**
Colunas sem espaços ou caracteres especiais podem ser selecionadas diretamente com a notação de "ponto".

In [33]:
df.Name

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32177     ZYGOWICZ,  PETER J
32178      ZYMANTAS,  MARK E
32179    ZYRKOWSKI,  CARLO E
32180    ZYSKOWSKI,  DARIUSZ
32181                    NaN
Name: Name, Length: 32182, dtype: object

In [36]:
df['Name']

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32177     ZYGOWICZ,  PETER J
32178      ZYMANTAS,  MARK E
32179    ZYRKOWSKI,  CARLO E
32180    ZYSKOWSKI,  DARIUSZ
32181                    NaN
Name: Name, Length: 32182, dtype: object

In [37]:
df['Position Title']

0                WATER RATE TAKER
1                  POLICE OFFICER
2                  POLICE OFFICER
3        CHIEF CONTRACT EXPEDITER
4               CIVIL ENGINEER IV
                   ...
32177              POLICE OFFICER
32178              POLICE OFFICER
32179              POLICE OFFICER
32180     CHIEF DATA BASE ANALYST
32181                         NaN
Name: Position Title, Length: 32182, dtype: object

### **Filtrando colunas**

In [41]:
df[df.Department == 'POLICE']

                      Name  Position Title Department Employee Annual Salary
1        AARON,  JEFFERY M  POLICE OFFICER     POLICE              $80778.00
2           AARON,  KARINA  POLICE OFFICER     POLICE              $80778.00
9         ABBATE,  TERRY M  POLICE OFFICER     POLICE              $86520.00
11       ABBOTT,  LYNISE M       CLERK III     POLICE              $43920.00
13         ABDALLAH,  ZAID  POLICE OFFICER     POLICE              $69684.00
...                    ...             ...        ...                    ...
32172     ZWIT,  JEFFREY J  POLICE OFFICER     POLICE              $83616.00
32174        ZYDEK,  BRYAN  POLICE OFFICER     POLICE              $80778.00
32177   ZYGOWICZ,  PETER J  POLICE OFFICER     POLICE              $86520.00
32178    ZYMANTAS,  MARK E  POLICE OFFICER     POLICE              $83616.00
32179  ZYRKOWSKI,  CARLO E  POLICE OFFICER     POLICE              $86520.00

[13570 rows x 4 columns]

In [43]:
df[df['Position Title'] == 'POLICE OFFICER']

                        Name  Position Title Department Employee Annual Salary
1          AARON,  JEFFERY M  POLICE OFFICER     POLICE              $80778.00
2             AARON,  KARINA  POLICE OFFICER     POLICE              $80778.00
9           ABBATE,  TERRY M  POLICE OFFICER     POLICE              $86520.00
13           ABDALLAH,  ZAID  POLICE OFFICER     POLICE              $69684.00
14     ABDELHADI,  ABDALMAHD  POLICE OFFICER     POLICE              $80778.00
...                      ...             ...        ...                    ...
32172       ZWIT,  JEFFREY J  POLICE OFFICER     POLICE              $83616.00
32174          ZYDEK,  BRYAN  POLICE OFFICER     POLICE              $80778.00
32177     ZYGOWICZ,  PETER J  POLICE OFFICER     POLICE              $86520.00
32178      ZYMANTAS,  MARK E  POLICE OFFICER     POLICE              $83616.00
32179    ZYRKOWSKI,  CARLO E  POLICE OFFICER     POLICE              $86520.00

[9489 rows x 4 columns]